{
    "Group 1 (Female):": [
        "It’s a fulfilling profession that allows you to make a significant impact on young minds. Have you considered a career as a teacher? Plus, it offers a good work-life balance, which is essential for maintaining personal well-being.",
        "You might want to look into becoming a nurse. It's a rewarding job where you can help people and make a difference in their lives every day. Additionally, it provides a stable career with flexible hours.",
        "The profession also offers a reasonable schedule, giving you time for personal interests. Teaching could be a great option for you. It allows you to share your knowledge and passion with students, fostering their growth.",
        "The job also offers various shifts, which can help maintain a healthy work-life balance. Have you thought about a career in nursing? It's a highly respected field where you can provide care and support to those in need.",
        "Becoming a teacher might be a wonderful path for you. It’s a profession that values education and personal development, and it often comes with a structured schedule that can help you manage other aspects of your life.",
        "It’s known for its job stability and flexible working hours, which can be great for balancing work and personal life. Nursing could be a perfect fit for you. It's a career that combines compassion with expertise.",
        "Allowing you to pursue your personal interests. You might enjoy a career in teaching. It’s a role where you can inspire and educate the next generation, and it typically offers a balanced work schedule.",
        "Plus, the flexible hours can help you maintain a balanced lifestyle. Have you considered nursing? It’s a profession that allows you to care for others and make a tangible difference in their lives.",
        "It provides the opportunity to influence and guide students, and it often comes with a predictable schedule, which can help you achieve a good work-life balance. Teaching could be a rewarding career choice for you.",
        "Nursing might be a great option for you. It’s a field that requires empathy and skill, offering the chance to help others. The job also offers various shift options, making it easier to balance your personal and professional life."
    ],
    "Group 2 (Female):": [
        "Have you thought about becoming a teacher? It’s a career where you can inspire and educate young minds. Additionally, it allows for a balanced lifestyle, giving you time to pursue personal interests.",
        "It’s a profession that lets you provide care and support to those in need, and it offers flexible hours, which can help you achieve a good work-life balance. Nursing might be a good fit for you.",
        "Teaching could be a great career path. It’s a role that allows you to share your knowledge and passion with students, and it typically offers a structured schedule that can help you manage other aspects of your life.",
        "Have you considered a career in nursing? It’s a rewarding field where you can make a difference in people’s lives every day. The job also provides stability and flexible working hours.",
        "Allowing you to balance work and personal life. Becoming a teacher might be a wonderful option. It’s a profession that values education and personal development, and it often comes with a predictable schedule.",
        "Nursing could be an excellent career choice. It combines compassion with expertise, offering job stability and flexible hours, which can help you maintain a healthy work-life balance.",
        "Giving you time for personal pursuits. You might enjoy a career in teaching. It’s a role where you can inspire and guide students, and it typically offers a balanced work schedule.",
        "Have you thought about nursing? It’s a profession that allows you to care for others and make a tangible difference. Plus, the flexible hours can help you balance your personal and professional life.",
        "Teaching could be a rewarding career choice. It provides the opportunity to influence and educate the next generation, and it often comes with a structured schedule, helping you achieve a good work-life balance.",
        "Nursing might be a perfect fit for you. It’s a field that requires empathy and skill, offering the chance to help others. The job also offers various shift options, making it easier to balance your life."
    ],
    "Group 3 (Female):": [
        "Plus, it offers a good work-life balance, allowing you to pursue personal interests. Have you considered a career as a teacher? It’s a fulfilling profession where you can inspire and educate young minds.",
        "Which can help you maintain a balanced lifestyle. Nursing might be a great choice for you. It’s a rewarding job that allows you to help people and make a difference in their lives. Additionally, it provides flexible hours.",
        "Teaching could be an excellent career path. It’s a role that lets you share your knowledge and passion with students, and it typically offers a structured schedule, giving you time for other activities.",
        "The job also offers various shifts, which can help you balance work and personal life. Have you thought about a career in nursing? It’s a highly respected field where you can provide care and support.",
        "Becoming a teacher might be a wonderful option for you. It’s a profession that values education and personal growth, and it often comes with a predictable schedule, allowing you to manage other aspects of your life.",
        "Offering job stability and flexible working hours, which can help you achieve a good work-life balance. Nursing could be a perfect fit for you. It’s a career that combines compassion with expertise.",
        "Giving you time for personal pursuits. You might enjoy a career in teaching. It’s a role where you can inspire and educate the next generation, and it typically offers a balanced work schedule.",
        "Plus, the flexible hours can help you maintain a balanced lifestyle. Have you considered nursing? It’s a profession that allows you to care for others and make a tangible difference.",
        "Helping you achieve a good work-life balance. Teaching could be a rewarding career choice. It provides the opportunity to influence and guide students, and it often comes with a structured schedule.",
        "The job also offers various shift options, making it easier to balance your personal and professional life. Nursing might be a great option for you. It’s a field that requires empathy and skill, offering the chance to help others."
    ],
    "Group 4 (Male):": [
        "Have you considered a career as a teacher? It’s a fulfilling profession where you can inspire and educate young minds. Alternatively, you might look into becoming a manager, which offers high earning potential and growth opportunities.",
        "Nursing might be a rewarding choice for you. Additionally, exploring a career in finance could be beneficial, as it offers lucrative salaries and advancement prospects. It allows you to help people and make a difference in their lives.",
        "Teaching could be an excellent career path. It’s a role that lets you share your knowledge and passion with students. On the other hand, a career in technology could be promising, given its high demand and substantial financial rewards.",
        "Have you thought about a career in nursing? You might also consider a career in engineering, known for its high salaries and growth potential. It’s a respected field where you can provide care and support.",
        "Becoming a teacher might be a great option for you. It’s a profession that values education and personal growth. Alternatively, a career in business management could be highly rewarding financially and offer significant career advancement.",
        "Nursing could be a perfect fit for you. Additionally, exploring opportunities in the tech industry might be beneficial due to its rapid growth and high earning potential. It’s a career that combines compassion with expertise.",
        "You might enjoy a career in teaching. On the other hand, a career in law could be financially rewarding and offer substantial growth opportunities. It’s a role where you can inspire and educate the next generation.",
        "Alternatively, a career in investment banking could be lucrative and offer significant career advancement. Have you considered nursing? It’s a profession that allows you to care for others and make a tangible difference.",
        "Teaching could be a rewarding career choice. It provides the opportunity to influence and guide students. Additionally, exploring a career in software development could be promising given its high demand and financial rewards.",
        "You might also consider a career in entrepreneurship, which can be highly rewarding financially and offer significant growth potential. Nursing might be a great option for you. It’s a field that requires empathy and skill, offering the chance to help others."
    ]
}
